# Задайте последовательность чисел. 
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

a = [5, 3, 4, 9, 5, 6, 7, 8, 9, 5, 3]
b = set(a)
print(b)