# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# Пример:

# - 6782 -> 23
# - 0,56 -> 11


x = input('Введите число ')

def summa(x):                            #Функция нахождения суммы чисел в заданном числе
    if float(x) < 0:                            #Проверка на знак перед числом
        x = float(x) * (-1)
    number = 0

    for i in str(x):
        if i != '.':
            number += int(i)
    return number

   
print(f'Сумма чисел равна {summa(x)}')

# float_num = input('input float number: ')

# sum = 0
# for i in float_num:
#     if i != '.':
#         sum += int(i)
# print(sum)

# x =float(0.25 % 0.04)
# print(round((x), 2))

#  if x > 1 or x < -1:
#         while x != 0:                        #Нахождение суммы
#             number = x % 10 + number
#             x = int(x / 10)
#     elif x < 1 and x > -1:
#         while x != '.':
#             number +=  int
#     return number